backend/views/kds-isu/_edit.php

SELECT * FROM `lookup_kategori_oku`
SELECT * FROM `lookup_kategori_isu`
SELECT * FROM `lookup_perkahwinan`
SELECT * FROM `lookup_agama`
SELECT * FROM `lookup_bangsa`
---
use common\models\LookupBangsa;
use dosamigos\datepicker\DatePicker;
use dosamigos\datetimepicker\DateTimePicker;
$kategori_oku = ArrayHelper::map(LookupKategoriOku::find()->asArray()->all(), 'id', 'kategori_oku');
$kategori_isu = ArrayHelper::map(LookupKategoriIsu::find()->asArray()->all(), 'id', 'kategori_isu');
$status_perkahwinan = ArrayHelper::map(LookupPerkahwinan::find()->asArray()->all(), 'id', 'status_perkahwinan');
$agama = ArrayHelper::map(LookupAgama::find()->asArray()->all(), 'id', 'agama');
$bangsa = ArrayHelper::map(LookupBangsa::find()->asArray()->all(), 'id', 'bangsa');