backend/controllers/DropdownController.php

SELECT * FROM `lookup_district` WHERE `state_id`='12'
---
	public function actionListstate($id)
	{

		if ($id == 21) {

			$model = LookupBahagian::find() ->where(['state_id' => $id])->all();
	        $listData=ArrayHelper::map($model,'bahagian_id','bahagian');
	        echo "<label class='control-label' >Bahagian</label>";
			echo Html::dropDownList('bahagian_id', null,$listData,['prompt' => '--Sila Pilih--','class'=>'form-control','id'=>'bahagian','onchange'=>'$.post( "'.Yii::$app->urlManager->createUrl(['dropdown/listdaerahsarawak','id'=>'']).'"+$(this).val(), function( data ) {$( "#show2" ).html( data );});']);
			echo "<div class='help-block'></div>";

		} elseif ($id == 22) {

			$model = LookupDistrict::find() ->where(['state_id' => $id])->all();
	        $listData=ArrayHelper::map($model,'district_id','district');
	        echo "<label class='control-label' >Daerah</label>";
			echo Html::dropDownList('district_id', null,$listData,['prompt' => '--Sila Pilih--','class'=>'form-control','id'=>'district','onchange'=>'$.post( "'.Yii::$app->urlManager->createUrl(['dropdown/listmukimjohor','id'=>'']).'"+$(this).val(), function( data ) {$( "#show2" ).html( data );});']);
			echo "<div class='help-block'></div>";

		} else {

			$model = LookupDistrict::find() ->where(['state_id' => $id])->all();

SELECT * FROM `lookup_sub_base` WHERE `district_id`='6'
---
	public function actionListsubbase($id)
	{
			$model = LookupSubBase::find() ->where(['district_id' => $id])->all();

SELECT * FROM `lookup_cluster` WHERE `sub_base_id`='5'
---
	public function actionListcluster($id)
	{
			$model = LookupCluster::find() ->where(['sub_base_id' => $id])->all();