backend/views/kds-sukarelawan/_form.php

    <div class="alert alert-info">
        <?php

        $states = LookupState::findOne($kawasan_perlaksanaan->state_id);
        $districts = LookupDistrict::findOne($kawasan_perlaksanaan->district_id);
        $subbases = LookupSubBase::findOne($kawasan_perlaksanaan->sub_base_id);
        $clusters = LookupCluster::findOne($kawasan_perlaksanaan->cluster_id);
        $kampungs = LookupKampung::findOne($kawasan_perlaksanaan->kampung_id);
---
SELECT * FROM `lookup_state` WHERE `state_id`='12'
SELECT * FROM `lookup_district` WHERE `district_id`='6'
SELECT * FROM `lookup_sub_base` WHERE `sub_base_id`='5'
SELECT * FROM `lookup_cluster` WHERE `cluster_id`='11'
SELECT * FROM `lookup_kampung` WHERE `kampung_id`='9'