backend/views/dropdown/sukarelawan.php

SELECT * FROM `lookup_state` WHERE `kawasan_perlaksanaan`='Ya'
---
use common\models\LookupCluster;
use common\models\LookupKampung;

$state = ArrayHelper::map(LookupState::find()->where(['kawasan_perlaksanaan'=>'Ya'])->asArray()->all(), 'state_id', 'state');