backend/modules/gallery/views/gallery-info/_form.php

SELECT * FROM `lookup_state` WHERE `kawasan_perlaksanaan`='Ya'
---

$this->registerJs($js);

$state = ArrayHelper::map(LookupState::find()->where(['kawasan_perlaksanaan'=>'Ya'])->asArray()->all(), 'state_id', 'state');