backend/modules/gallery/controllers/GalleryInfoController.php

    public function actionGallery($id)
    {
        $this->layout = 'gallery';
        $models = GalleryImages::find()->where(['gallery_info_id'=>$id])->all();
---
SELECT * FROM `gallery_images` WHERE `gallery_info_id`='11'